## Staging: dynamodb
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                NAME                |
|----------|------------------------------------|
| recreate | `aws_dynamodb_table.url_shortener` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.url_shortener must be replaced
-/+ resource "aws_dynamodb_table" "url_shortener" {
      ~ arn              = "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener" -> (known after apply)
      ~ hash_key         = "short_url" -> "key_id" # forces replacement
      ~ id               = "url_shortener" -> (known after apply)
        name             = "url_shortener"
      ~ read_capacity    = 0 -> (known after apply)
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
        tags             = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
      ~ write_capacity   = 0 -> (known after apply)
        # (2 unchanged attributes hidden)

      + attribute {
          + name = "email"
          + type = "S"
        }
      + attribute {
          + name = "key_id"
          + type = "S"
        }
      - attribute {
          - name = "short_url" -> null
          - type = "S" -> null
        }

      + global_secondary_index {
          + hash_key           = "email"
          + name               = "emailIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = 1
          + write_capacity     = 1
        }

      ~ server_side_encryption {
          + kms_key_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ url_shortener_table_arn  = "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener" -> (known after apply)
  ~ url_shortener_table_name = "url_shortener" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
